index.org
#+TITLE: Homepage of Simin Yang
#+AUTHOR: Simin Yang
#+EMAIL: smyang.ustc@gmail.com
#+OPTIONS: toc:nil
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:showall tdepth:nil ltoc:nil

* About me
    I got my Master degree in Computer Software and Theory from
    [[http://kyhcs.ustcsz.edu.cn/][USTC-Yale Joint Research Center for High-Confidence Software]] of
    [[http://cs.ustc.edu.cn/][School of Computer Science]], [[http://www.ustc.edu.cn/][University of Science and Technology
    of China]]. My advisor was [[http://staff.ustc.edu.cn/~yiyun/][Prof. Yiyun Chen]].

    Email : [[mailto:smyang.ustc@gmail.com][smyang.ustc {at} gmail.com]]

* Research Interests
  + Compiler, especially Certifying Compiler
  + Program Verification and Automated Theorem Proving
  + Coq

* Technical Interests
  + Linux(Debian), GNU/Emacs
  + SML, O'Caml, C/C++
  + Script languages

* Hobbies
  + Trekking, Camping
  + Dota, BoardGames
  + Diablo
