index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Homepage of Simin Yang</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-15 14:01:16 CST"/>
<meta name="author" content="Simin Yang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./base.css">
</head>
<body>
<div id="content">

<h1 class="title">Homepage of Simin Yang</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 About me </a></li>
<li><a href="#sec-2">2 Research Interests </a></li>
<li><a href="#sec-3">3 Technical Interests </a></li>
<li><a href="#sec-4">4 Hobbies </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About me </h2>
<div class="outline-text-2" id="text-1">

<p>I got my Master degree in Computer Software and Theory from
<a href="http://kyhcs.ustcsz.edu.cn/">USTC-Yale Joint Research Center for High-Confidence Software</a> of
<a href="http://cs.ustc.edu.cn/">School of Computer Science</a>, <a href="http://www.ustc.edu.cn/">University of Science and Technology of China</a>. My advisor was <a href="http://staff.ustc.edu.cn/~yiyun/">Prof. Yiyun Chen</a>.
</p>
<p>
Email : <a href="mailto:smyang.ustc@gmail.com">smyang.ustc {at} gmail.com</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Research Interests </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
Compiler, especially Certifying Compiler
</li>
<li>
Program Verification and Automated Theorem Proving
</li>
<li>
Coq

</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Technical Interests </h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>
Linux(Debian), GNU/Emacs
</li>
<li>
SML, O'Caml, C/C++
</li>
<li>
Script languages

</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Hobbies </h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>
Trekking, Camping
</li>
<li>
Dota, BoardGames
</li>
<li>
Diablo
</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Simin Yang
<a href="mailto:smyang.ustc@gmail.com">&lt;smyang.ustc@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2011-09-15 14:01:16 CST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
